# Position Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasePoint..::..Position Property
BasePoint Class See Also
---
Position of the BasePoint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public XYZ Position { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Position As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Position {
	XYZ^ get ();
}
```

# See Also
BasePoint Class
Autodesk.Revit.DB Namespace